# OpenAreaLoadLoopError Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
BuiltInFailures..::..SketchFailures..::..OpenAreaLoadLoopError Property
BuiltInFailures..::..SketchFailures Class See Also
---
Area Load Sketch can't contain open loops.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OpenAreaLoadLoopError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OpenAreaLoadLoopError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OpenAreaLoadLoopError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace